/*//Задача 1

let С = Number(prompt('Введите температуру в градусах Цельсия'));
let F = 9 / 5;
alert(`Температура в градусах Фаренгейта: ${F * С + 32}`);




//задача 2
let name = 'Marina';
let admin = name;
console.log(admin);


//Задача 3

console.log(10 + 10 + "10"); //10 плюс 10 + строка == строка "2010";

console.log(10 + "10" + 10); //число 10 + строка "10" == строка "1010", затем строка + число == строка "101010";

console.log(10 + 10 + +"10"); //++ преобразуют строку в число, 10 + 10 + 10 == 30;

console.log(10 / -""); //10 разделить на 0 с бинарным минусом == - Infinity; 

console.log(10 / +"2,5"); // 10 разделить на NaN (ошибка чтения числа на месте символа ",") == NaN, при +"2.5" определось бы как число;


// Задача 4

let numUser = Number(prompt('Введите любое целое число'));

numUser = Math.round(numUser); //если пользователь введет десятичное число, автоматически его округлим.
numUser = Math.abs(numUser); //отрицательное число переведем в положительное;
 
let hundreds = numUser / 100;
let tens = (numUser % 100)/10;
let units = numUser % 10;

console.log(`В числе ${numUser} количество сотен: ${Math.floor(hundreds)}, десятков: ${Math.floor(tens)}, единиц: ${units}`);*/


